# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Platform built on V8 to build network applications
brew "node"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
# Note: bun is installed via its own installer: curl -fsSL https://bun.sh/install | bash
# brew "bun"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cross-shell prompt for astronauts
brew "starship"
# Modern, maintained replacement for ls
brew "eza"
# A better cd command
brew "zoxide"
# Simple terminal UI for git commands
brew "lazygit"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Fast, feature-rich, GPU-accelerated terminal emulator
cask "ghostty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "whatsapp"
cask "signal"
# Trying Zen browser instead of Firefox
cask "zen"
# cask "firefox"
cask "bitwarden"
cask "google-chrome"
brew "neovim"
brew "stow"
cask "bambu-studio"
cask "google-drive"
cask "hammerspoon"
brew "fastfetch"
cask "microsoft-office-businesspro"
brew "pam-reattach"
brew "fd"
brew "wget"
brew "lua"
brew "luarocks"
brew "go"
brew "openjdk"
cask "tunnelblick"
brew "gitleaks"
cask "pgadmin4"
brew "bat"
brew "ruby"
brew "chruby"
brew "ruby-install"
cask "karabiner-elements"
brew "diff-so-fancy"
brew "ffmpeg"
cask "claude"
cask "claude-code"
# macOS notifications from terminal
brew "terminal-notifier"

# ================================
# CLI Tools & Utilities
# ================================
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor
brew "btop"
# Terminal document viewer for .docx files
brew "doxx"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# A modern, keyboard-first PostgreSQL CLI
brew "fcoury/tap/tsql"
# GNU database manager
brew "gdbm"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open-source GitLab command-line tool
brew "glab"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Mac App Store command-line interface
brew "mas"
# Run multiple commands in parallel
brew "mprocs"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Rsync for cloud storage
brew "rclone"
# Rust toolchain installer
brew "rustup"
# RSS Reader for Digital Minimalists
brew "superstarryeyes/tap/hys"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Simple terminal image viewer written in Rust
brew "viu"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"

# ================================
# GUI Applications
# ================================
# Voice and text chat software
cask "discord"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Graphical client for Git version control
cask "sourcetree"

# ================================
# Visual Assets / Diagram Tools
# ================================
# UML and diagram generation tool
brew "plantuml"
# Modern diagram scripting language
brew "d2"
# SVG to PNG/PDF converter (for D3.js exports)
brew "librsvg"
# Image manipulation (for format conversions)
brew "imagemagick"