# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Platform built on V8 to build network applications
brew "node"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
# Note: bun is installed via its own installer: curl -fsSL https://bun.sh/install | bash
# brew "bun"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cross-shell prompt for astronauts
brew "starship"
# Modern, maintained replacement for ls
brew "eza"
# A better cd command
brew "zoxide"
# Simple terminal UI for git commands
brew "lazygit"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# Fast, feature-rich, GPU-accelerated terminal emulator
cask "ghostty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "whatsapp"
cask "signal"
# Trying Zen browser instead of Firefox
cask "zen"
# cask "firefox"
cask "bitwarden"
cask "google-chrome"
brew "neovim"
brew "stow"
cask "bambu-studio"
cask "google-drive"
cask "hammerspoon"
brew "fastfetch"
cask "microsoft-office-businesspro"
brew "pam-reattach"
brew "fd"
brew "wget"
brew "lua"
brew "luarocks"
brew "go"
brew "openjdk"
cask "tunnelblick"
brew "gitleaks"
cask "pgadmin4"
brew "bat"
brew "ruby"
brew "chruby"
brew "ruby-install"
cask "karabiner-elements"
brew "diff-so-fancy"
brew "ffmpeg"
cask "claude"
cask "claude-code"
# macOS notifications from terminal
brew "terminal-notifier"

# ================================
# Visual Assets / Diagram Tools
# ================================
# UML and diagram generation tool
brew "plantuml"
# Modern diagram scripting language
brew "d2"
# SVG to PNG/PDF converter (for D3.js exports)
brew "librsvg"
# Image manipulation (for format conversions)
brew "imagemagick"